#+TITLE: Álgebra III
#+AUTHOR: Mario Román
#+EMAIL: mromang08@gmail.com

#+SETUPFILE: config.setup
#+LANGUAGE: es

*** Ejercicio 2.16
 Tenemos una extensión sobre $\mathbb{F}_2$ generada por un polinomio de grado 3. 
 Sus elementos son clases de equivalencia sobre polinomios de hasta 
 grado dos, habiendo 8 elementos. Abusando de la notación, los escribimos como
 los representantes de su clase de equivalencia:

 \[\{0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1\}\]

 Tenemos las siguientes tablas para la suma y el producto:

 #+BEGIN_SRC sage :exports none
 R.<t> = PolynomialRing(GF(2),'t')
 I = R.ideal(t^3+t+1)
 S.<x> = R.quotient_ring(I)
 #+END_SRC
 #+RESULTS:

 #+BEGIN_SRC sage :exports results
 S.addition_table(
     names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
     elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
 )
 #+END_SRC
 #+RESULTS:
 #+begin_example

       +        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
	+----------------------------------------------------------------
       0|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       1|       1       0     x+1       x   x^2+1     x^2 x^2+x+1   x^2+x
       x|       x     x+1       0       1   x^2+x x^2+x+1     x^2   x^2+1
     x+1|     x+1       x       1       0 x^2+x+1   x^2+x   x^2+1     x^2
     x^2|     x^2   x^2+1   x^2+x x^2+x+1       0       1       x     x+1
   x^2+1|   x^2+1     x^2 x^2+x+1   x^2+x       1       0     x+1       x
   x^2+x|   x^2+x x^2+x+1     x^2   x^2+1       x     x+1       0       1
 x^2+x+1| x^2+x+1   x^2+x   x^2+1     x^2     x+1       x       1       0
 #+end_example

 #+BEGIN_SRC sage :exports results
 S.multiplication_table(
     names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
     elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
 )
 #+END_SRC
 #+RESULTS:
 #+begin_example

       *        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
	+----------------------------------------------------------------
       0|       0       0       0       0       0       0       0       0
       1|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       x|       0       x     x^2   x^2+x     x+1       1 x^2+x+1   x^2+1
     x+1|       0     x+1   x^2+x   x^2+1 x^2+x+1     x^2       1       x
     x^2|       0     x^2     x+1 x^2+x+1   x^2+x       x   x^2+1       1
   x^2+1|       0   x^2+1       1     x^2       x x^2+x+1     x+1   x^2+x
   x^2+x|       0   x^2+x x^2+x+1       1   x^2+1     x+1       x     x^2
 x^2+x+1|       0 x^2+x+1   x^2+1       x       1   x^2+x     x^2     x+1
 #+end_example

**** Punto 2
 Tenemos a $1,\sqrt{2},\sqrt{3},\sqrt{5},\sqrt{6},\sqrt{10},\sqrt{15},\sqrt{30}$ sistema de generadores del espacio,
 y por ser de dimensión $8$, sabemos que forman una base. Veamos que $1,\alpha,\alpha^2,\dots,\alpha^7$ es una base 
 del mismo espacio comprobando independencia lineal sobre la base inicial.

 #+BEGIN_SRC sage :exports none
   A = FreeAlgebra(QQ,3,'i')
   F = A.monoid()
   a,b,c = F.gens()
   mons = [ F(1), a,b,c,a*b,a*c,b*c,a*b*c ]
   M = MatrixSpace(QQ,len(mons))
   mats = [
       M([0,1,0,0,0,0,0,0,
          2,0,0,0,0,0,0,0,
          0,0,0,0,1,0,0,0,
          0,0,0,0,0,1,0,0,
          0,0,2,0,0,0,0,0,
          0,0,0,2,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,0,0,0,0,0,2,0
       ]),
       M([0,0,1,0,0,0,0,0,
          0,0,0,0,1,0,0,0,
          3,0,0,0,0,0,0,0,
          0,0,0,0,0,0,1,0,
          0,3,0,0,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,0,0,3,0,0,0,0,
          0,0,0,0,0,3,0,0
       ]),
       M([0,0,0,1,0,0,0,0,
          0,0,0,0,0,1,0,0,
          0,0,0,0,0,0,1,0,
          5,0,0,0,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,5,0,0,0,0,0,0,
          0,0,5,0,0,0,0,0,
          0,0,0,0,5,0,0,0
       ])
   ]
   P3.<a,b,c> = A.quotient(mons,mats)
 #+END_SRC

 #+RESULTS:

 Para ello escribo los coeficientes de cada $\alpha^n$ en la
 base inicial formando la siguiente matriz y compruebo que son linealmente independientes.

 #+BEGIN_SRC sage :exports results
 M = matrix([ ((a+b+c)^n).vector() for n in range(0,8) ]).transpose()
 M
 #+END_SRC

 #+RESULTS:
 : 
 : [    1     0    10     0   224     0  6160     0]
 : [    0     1     0    26     0   784     0 23024]
 : [    0     1     0    24     0   664     0 18976]
 : [    0     1     0    20     0   520     0 14720]
 : [    0     0     2     0    80     0  2448     0]
 : [    0     0     2     0    64     0  1904     0]
 : [    0     0     2     0    56     0  1584     0]
 : [    0     0     0     6     0   200     0  5936]

 Si calculamos el rango de esta matriz, obtenemos que es invertible.

 #+BEGIN_SRC sage :exports both
 M.rank()
 #+END_SRC

 #+RESULTS:
 : 8

**** Punto 3
 Usando la matriz anterior, obtengo un polinomio que tiene por raíz
 a $\sqrt{2}+\sqrt{3}+\sqrt{5}$. Para ello escribo los coeficientes de $\alpha^8$ en
 función de la base anterior de la matriz.

 #+BEGIN_SRC sage :exports both
 M.solve_right(vector(QQ,((a+b+c)^8).vector()))
 #+END_SRC

 #+RESULTS:
 : (-576, 0, 960, 0, -352, 0, 40, 0)

 Así que tengo el polinomio siguiente del que $\alpha$ es raíz:

 \[t^8-40*t^6+352*t^4-960*t^2+576\]

 # Checking the answer
 #+BEGIN_SRC sage :exports none
 t = sqrt(2)+sqrt(3)+sqrt(5)
 (-40*t^6+352*t^4-960*t^2+576+t^8).expand()
 #+END_SRC

 #+RESULTS:
 : 0

